Revit 2027 API
Application.NewPointOnEdgeFaceIntersection Method
Construct a PointOnEdgeFaceIntersection object which is used to define the placement of a ReferencePoint given a references to edge and a reference to face.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointOnEdgeFaceIntersection NewPointOnEdgeFaceIntersection(
	Reference edgeReference,
	Reference faceReference,
	bool orientWithEdge
)
Public Function NewPointOnEdgeFaceIntersection (
	edgeReference As Reference,
	faceReference As Reference,
	orientWithEdge As Boolean
) As PointOnEdgeFaceIntersection
public:
PointOnEdgeFaceIntersection^ NewPointOnEdgeFaceIntersection(
	Reference^ edgeReference,
	Reference^ faceReference,
	bool orientWithEdge
)
member NewPointOnEdgeFaceIntersection :
        edgeReference : Reference *
        faceReference : Reference *
        orientWithEdge : bool -> PointOnEdgeFaceIntersection
Parameters
edgeReference Reference
The edge reference.
faceReference Reference
The face reference.
orientWithEdge Boolean
Return Value
PointOnEdgeFaceIntersection
A new PointOnEdgeFaceIntersection object.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument edgeReference or faceReference is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace